Tekla.Structures.ModelInternal.EventHandler.AddListener(Tekla.Structures.Model.IEvents)
DO NOT USE! For internal usage only!
EventListener:

Tekla.Structures.ModelInternal.EventHandler.AddUIListener(Tekla.Structures.ModelInternal.dotClientId_t,Tekla.Structures.ModelInternal.IInputGeometryEvents)
DO NOT USE! For internal usage only!
ClientID:
EventListener:

Tekla.Structures.ModelInternal.EventHandler.RemoveListener(Tekla.Structures.Model.IEvents)
DO NOT USE! For internal usage only!
EventListener:

Tekla.Structures.ModelInternal.EventHandler.RemoveUIListener(Tekla.Structures.ModelInternal.dotClientId_t,Tekla.Structures.ModelInternal.IInputGeometryEvents)
DO NOT USE! For internal usage only!
ClientID:
EventListener:

Tekla.Structures.ModelInternal.EventHandler.UnsubscribeEvent(System.String,Tekla.Structures.Model.IEvents)
Unegisters an event listener to the event
eventName:  name of the event to subscribe to
eventListener:  Event Listener who is interested in the event
Returns: success/failure

Tekla.Structures.ModelInternal.EventHandler.OnModelObjectChangedEvent(System.String,System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},System.Collections.Generic.List{Tekla.Structures.Model.ChangeData.ChangeTypeEnum},System.Collections.Generic.List{Tekla.Structures.Model.ChangeData.ChangeSourceTypeEnum})
sends changed objects event is raised to listeners.
Param: Name of the event
ChangedObjects: Changed of the event
NumberedObjects: Name of the event
CommitTypes: Type of the event
CommitSourceTypes: Source of the event
Returns: 1

Tekla.Structures.ModelInternal.EventHandler.GetViewIdForCameraChangedEvent(System.Int32@)
Gets the view id for camera changed event